<template>
    <!-- Progress bar -->
     <div class="section w-full py-8">
        <div class="bg-green-1 w-full h-2 rounded"></div>
     </div>

    <!-- Question -->
     <div class="section text-center bg-white p-10 rounded-2xl shadow-md">
        <h2 class="text-h8 font-kondolar font-bold">ร่าง พ.ร.บ. นิรโทษกรรมประชาชน ฉบับประชาชน</h2>
        <p>ชื่อเต็ม: ร่างพระราชบัญญัตินิรโทษกรรมประชาชน พ.ศ. .... ซึ่ง นางสาวพูนสุข พูนสุขเจริญกับประชาชนผู้มีสิทธิเลือกตั้ง จำนวน ๓๖,๗๒๓ คน เป็นผู้เสนอ</p>
        <h3 class="font-bold">รายละเอียด</h3>
        <p>ร่าง พ.ร.บ. ป้องกันการอุ้มหายและซ้อมทรมาน มีสาระสำคัญคือ การเพิ่มบทบัญญัติว่าด้ายการกระทำความผิดฐานกระทำการที่โหดร้าย ไร้มนุษยธรรม หรือที่ย้ำยีศักดิ์ศรีความเป็นมนุษย์ กำหนดให้มีการบันทึกภาพและเสียงในการตรวจค้นในคดีอาญา และการบันทึกภาพและเสียงในขณะจับกุมตรวจค้นในคดีอาญา องค์ประกอบของคณะกรรมการป้องกันและปราบปรามการทรมานและการกระทำให้บุคคลสูญหาย มีความครอบคลุมทุกมิติ ทั้งด้านสิทธิมนุษยชน ด้านกฎหมาย แพทย์ทางนิติเวชและทางจิตเวชศาสตร์และกำหนดให้ฝ่ายนิติบัญญัติซึ่งเป็นตัวแทนประชาชนได้มีส่วนร่วมในกระบวนการสรรหาคณะกรรมการดังกล่าว และให้คดีตามพ.ร.บ.ฉบับนี้เป็นคดีพิเศษ และกำหนดให้หลายหน่วยงานเข้ามาร่วมสอบสวน ซึ่งจะเป็นประโยชน์ในด้านการดำเนินคดี และรวบรวมพยานหลักฐานให้ทันกับสถานการณ์และป้องกันการทำลายพยานหลักฐานสำคัญในคดี</p>

     </div>

    <!-- Quiz Choices -->

    <!-- Quiz Navigation -->
</template>