'use client';

import Link from 'next/link';
import { Carousel } from '../Carousel';
import { PartySelect, PartySelectChoice } from '../PartySelect';
import { TopicCard } from './TopicCard';

export const EXAMPLE_PARTIES: PartySelectChoice[] = [
	{ value: 'ภูมิใจไทย' },
	{ value: 'ประชาชน' },
	{ value: 'เพื่อไทย' },
	{ value: 'พลังประชารัฐ', disabled: true },
	{ value: 'ประชาธิปัตย์', disabled: true },
];

const EXAMPLE_DATA = {
	problem: `- ประชากรกว่า 40% อยู่ในภาคเกษตร แต่มีรายได้เพียงประมาณ 8% ของ GDP
- การแก้ปัญหาในภาคเกษตรไม่ถูกจุด
- เกษตรกรไทยอยู่ในวงเวียนวัฏจักรของความยากจน
- ราคา และผลผลิตต่อไร่ที่ต่ำ
- ต้นทุนการผลิตที่สูงกว่าครึ่งหนึ่งของรายรับ
- รายได้เหลือไม่พอต่อการชำระหนี้ และการยังชีพอย่างมีคุณภาพ
- โรคเชื้อราที่ต้นยาง
- ต้นยางตายนึ่ง (กรีดแล้วไม่มีน้ำยาง)
- โรคเชื้อราที่รากและหัวมันฯ ที่อยู่ในดิน
- โรคไวรัสใบด่าง *ที่* ใบ *มันสำปะหลัง* *ถูกคุกคาม*
- *ทั้งสองโรค (เชื้อราที่รากและหัวมันฯ และไวรัสใบด่าง)* ทำให้ผลผลิตต่อไร่เฉลี่ยทั้งประเทศสูญหายไปกว่าครึ่ง`,
	action: `- การเกษตรจะต้องเปลี่ยนวิธีคิด และวิธีการเสียใหม่ ด้วยหลักคิด “ตลาดนำ นวัตกรรมเสริม เพิ่มรายได้”
- พรรคเพื่อไทยจะสร้างระบบยืนยันราคา
- นำนวัตกรรมการเกษตรมาเพิ่มปริมาณผลผลิต
- ลดต้นทุนการผลิต
- พักหนี้เกษตรกร 3 ปี ทั้งต้น ทั้งดอก *ทันที*
- มุ่งสร้างรายได้ให้พี่น้องเกษตรกร *ด้วย* หลัก “ตลาดนำ นวัตกรรมเสริม เพิ่มรายได้”
- สร้างทางเลือกให้เกษตรกรเพื่อผลิตสิ่งที่ตลาดต้องการ
- เปิดตลาดใหม่เพิ่มโอกาสในการส่งออกสินค้าให้เกษตร
- ใช้เทคโนโลยีสมัยใหม่สร้างความแม่นยำในการเพาะปลูก
- ใช้นวัตกรรม Blockchain เพื่อประกันราคาสินค้าเกษตรล่วงหน้า
- สร้างความเป็นธรรมให้เกษตรกรด้วยการให้ราคาผลผลิตที่เกษตรกรควรได้รับ
- ผ่าตัดภาคเกษตรเริ่มที่การ “เพิ่มอุปสงค์และปรับอุปทานภาคการเกษตร”
- นำนวัตกรรมมาสนับสนุน การเพิ่มผลิตภาพ การลดต้นทุน การแปรรูปสู่มูลค่าที่เพิ่มสูงขึ้น ตามแนวทาง 6 ประการ:
- - ดินนำน้ำดี
- - มีสายพันธุ์
- - ยืนยันราคา
- - จัดหาแหล่งทุน
- - หนุนนำนวัตกรรม
- - จัดทำกรรมสิทธิ์ที่ดิน
- **ข้าว:** ปรับเปลี่ยนนาหว่านสู่นาดำ / นาหยอด
- **ข้าว:** งดเผางดนำฟางออกจากแปลง
- **ข้าว:** ใช้จุลินทรีย์คุณภาพสูงเพื่อรักษาธาตุอาหารให้หมุนเวียน
- **ยางพารา:** ปรับสูตรและเปลี่ยนวิธีใส่ปุ๋ยเสียใหม่
- **ยางพารา:** รักษาโรคเชื้อราที่ต้นยาง
- **ยางพารา:** ฟื้นฟูต้นยางตายนึ่ง (กรีดแล้วไม่มีน้ำยาง) ให้กลับมากรีดได้อีก
- **มันสำปะหลัง:** ป้องกัน และรักษาโรคเชื้อราที่รากและหัวมันฯ ที่อยู่ในดิน
- **มันสำปะหลัง:** รักษาฟื้นฟูใบ ที่ถูกคุกคามด้วยโรคไวรัสใบด่าง
- **ลำไย:** ปรับคุณภาพดินให้มีความพร้อมกับการเจริญเติบโตของต้นลำไย
- **ลำไย:** สนับสนุนด้วยชีวภัณฑ์
- **ข้าวโพด / ถั่วเหลือง:** ให้ความสำคัญกับการพัฒนาสายพันธุ์ที่เหมาะสมกับพื้นที่
- **ข้าวโพด / ถั่วเหลือง:** การให้ปุ๋ยที่เหมาะสม ผสมผสานระหว่างปุ๋ยอนินทรีย์ และอินทรีย์
- **ข้าวโพด / ถั่วเหลือง:** การพัฒนาอุปกรณ์เก็บเกี่ยวที่เพิ่มความสะดวก และลดการสูญเสีย
- เพิ่มโอกาสให้เกษตรกรมีทางเลือกใหม่ๆ
- ส่งเสริมการปลูกพืชอาหารสัตว์ที่มีโปรตีนสูง และคาร์โบไฮเดรตสูง ในจำนวนที่มากขึ้น
- ส่งเสริมการปลูกพืชสมุนไพร เพื่อนำไปสู่การแปรรูป และการสกัดสารสำคัญ
- ส่งเสริมการเลี้ยงโค
- *ส่งเสริมการเลี้ยง* ปศุสัตว์อื่นได้แก่ แพะ แกะ ไก่งวง ฯลฯ และประมงน้ำจืดด้วย
- ส่งเสริมการใช้เทคโนโลยีการเกษตรแม่นยำ (Precision Agriculture) และปัญญาประดิษฐ์ (AI)`,
	outcome_indicator: `- รายได้ของเกษตกรจะเพิ่มเป็น “3 เท่า” *จากรายได้เฉลี่ย 10,000 บาท/ไร่/ปี เพิ่มเป็น 30,000 บาท/ไร่/ปี*
- ราคาสินค้าเกษตรดี
- เพิ่มปริมาณผลผลิต
- ลดต้นทุนการผลิต
- รายได้ (สุทธิ) ของเกษตรกรจะเพิ่มขึ้นอย่างก้าวกระโดดเป็น 3 เท่าของที่เคยได้รับ
- ลดภาระในการทำมาหากินของพี่น้องเกษตรกร
- *พี่น้องเกษตรกร* มีรายได้เพิ่มขึ้น 3 เท่า
- เพิ่มโอกาสในการส่งออกสินค้าให้เกษตร
- สร้างความแม่นยำในการเพาะปลูกเพื่อเพิ่มจำนวนและคุณภาพของผลผลิต
- *มี* ประกันราคาสินค้าเกษตรล่วงหน้า
- *มี* ความเป็นธรรมให้เกษตรกรด้วยการให้ราคาผลผลิตที่เกษตรกรควรได้รับ
- เพิ่มอุปสงค์และปรับอุปทานภาคการเกษตร
- เพิ่มผลิตภาพ
- ลดต้นทุน
- แปรรูปสู่มูลค่าที่เพิ่มสูงขึ้น
- **ข้าว:** ลดต้นทุนค่าปุ๋ย
- **ข้าว:** เพิ่มผลผลิตต่อไร่
- **ยางพารา:** *ต้นยางตายนึ่ง* กลับมากรีดได้อีก
- **ลำไย:** เพิ่มทั้งจำนวน ทั้งสัดส่วนของผลลำไยเกรดเอ
- **ข้าวโพด / ถั่วเหลือง:** *อุปกรณ์เก็บเกี่ยว* เพิ่มความสะดวก
- **ข้าวโพด / ถั่วเหลือง:** *อุปกรณ์เก็บเกี่ยว* ลดการสูญเสีย
- *เกษตรกร* มีทางเลือกใหม่ๆ
- *เกษตรกร* มีขนาดของความต้องการสินค้าเกษตรชนิดต่างๆ มากขึ้น
- *สามารถ* ทดแทนการนำเข้า *พืชอาหารสัตว์* มูลค่าปีละกว่า 300,000 ล้านบาท
- สร้างรายได้ต่อเนื่องไปยังเกษตรกรผู้ปลูกพืชอาหารสัตว์ เป็นวงกว้าง
- ยกระดับการเพิ่มประสิทธิภาพและผลผลิต
- *สามารถ* เปลี่ยนเกษตรดั้งเดิมเป็นการเกษตรก้าวหน้า`,
	timeframe: `- *Outcome:* ภายในปี 2570
- *Action:* 3 ปี
- *Action:* ทันที
- *Outcome:* ภายใน 4 ปี
- *Outcome:* ปีละกว่า 300,000 ล้านบาท`,
	target: `- ประชากร *ในภาคเกษตร*
- เกษตรกร
- เกษตรกรไทย
- พี่น้องเกษตรกร
- เกษตรกรผู้ปลูกพืชอาหารสัตว์`,
	budget: '',
	budget_source: '',
};

const SLIDES = Array(3).fill(<TopicCard data={EXAMPLE_DATA} />);

export interface TopicBodyProps {
	topic: string;
}

export const TopicBody = ({ topic }: TopicBodyProps) => {
	return (
		<>
			<header className="mx-auto flex w-[85svw] max-w-[600px] flex-col">
				<p className="text-h7 font-kondolar mt-5 text-center font-bold">
					ปัญหา
				</p>
				<h1 className="text-h3 font-kondolar text-center font-bold">{topic}</h1>
				<p className="text-b4 text-center font-bold">มี 4 คำสัญญา จาก</p>
				<PartySelect
					className="my-2.5 w-full"
					choices={EXAMPLE_PARTIES}
					allChoiceText={(count) => `${count} พรรคที่พูดถึงปัญหานี้`}
				/>
				<p className="text-b7 text-gray-1 mb-5 text-center">
					*ฐานข้อมูลมีจำนวนทั้งหมด 5 พรรค
					โดยเลือกเฉพาะพรรคที่มีข้อมูลนโยบายในเว็บไซต์ทางการ
				</p>
				<article className="text-purple-1 my-2.5 flex flex-col gap-[5px] rounded-[10px] bg-white/40 p-[15px]">
					<h2 className="font-bold">คำชี้แจง</h2>
					<ul className="ml-[2ch] list-outside list-disc">
						<li>
							ข้อมูลในหน้านี้มาจากข้อความบนเว็บไซต์ทางการของพรรคการเมือง
							ซึ่งถูกจัดลงตารางตามหัวข้อต่างๆ ด้วยระบบปัญญาประดิษฐ์ (LLM)
							โดยพยายามคงข้อความตามต้นฉบับให้มากที่สุด
						</li>
						<li>
							หากจำเป็นต้องเพิ่มข้อความเพื่อให้ได้ใจความที่สมบูรณ์ จะถูกแสดงด้วย
							<span className="text-gray-1">ตัวอักษรสีเทา</span>
						</li>
						<li>
							แม้มีการตรวจสอบโดยทีมงานในระดับหนึ่ง
							แต่อาจมีความคลาดเคลื่อนเกิดขึ้นได้
						</li>
						<li>
							ผู้ใช้สามารถตรวจสอบเพิ่มเติมกับข้อความต้นฉบับตามลิงก์ด้านล่าง
						</li>
					</ul>
					<Link
						className="self-end underline"
						href="/about#sources-and-limitations"
					>
						อ่านที่มาและข้อจำกัดข้อมูล
					</Link>
				</article>
			</header>
			<div className="mx-auto py-5 md:w-[85svw]">
				<Carousel slides={SLIDES} noDots />
			</div>
		</>
	);
};
